zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxScu_bf.h
/** \brief Mask for Ifx_SCU_DTSCLIM_Bits.BGPOK */
#define IFX_SCU_DTSCLIM_BGPOK_MSK (0x1u)

/** \brief Offset for Ifx_SCU_DTSCLIM_Bits.BGPOK */
#define IFX_SCU_DTSCLIM_BGPOK_OFF (13u)

/** \brief Length for Ifx_SCU_DTSCLIM_Bits.EN */
#define IFX_SCU_DTSCLIM_EN_LEN (1u)

/** \brief Mask for Ifx_SCU_DTSCLIM_Bits.EN */
#define IFX_SCU_DTSCLIM_EN_MSK (0x1u)

/** \brief Offset for Ifx_SCU_DTSCLIM_Bits.EN */
#define IFX_SCU_DTSCLIM_EN_OFF (14u)

/** \brief Length for Ifx_SCU_DTSCLIM_Bits.LLU */
#define IFX_SCU_DTSCLIM_LLU_LEN (1u)

/** \brief Mask for Ifx_SCU_DTSCLIM_Bits.LLU */
#define IFX_SCU_DTSCLIM_LLU_MSK (0x1u)

/** \brief Offset for Ifx_SCU_DTSCLIM_Bits.LLU */
#define IFX_SCU_DTSCLIM_LLU_OFF (15u)

/** \brief Length for Ifx_SCU_DTSCLIM_Bits.UPPER */
#define IFX_SCU_DTSCLIM_UPPER_LEN (12u)

/** \brief Mask for Ifx_SCU_DTSCLIM_Bits.UPPER */
#define IFX_SCU_DTSCLIM_UPPER_MSK (0xfffu)

/** \brief Offset for Ifx_SCU_DTSCLIM_Bits.UPPER */
#define IFX_SCU_DTSCLIM_UPPER_OFF (16u)

/** \brief Length for Ifx_SCU_DTSCLIM_Bits.INTEN */
#define IFX_SCU_DTSCLIM_INTEN_LEN (1u)

/** \brief Mask for Ifx_SCU_DTSCLIM_Bits.INTEN */
#define IFX_SCU_DTSCLIM_INTEN_MSK (0x1u)

/** \brief Offset for Ifx_SCU_DTSCLIM_Bits.INTEN */
#define IFX_SCU_DTSCLIM_INTEN_OFF (28u)

/** \brief Length for Ifx_SCU_DTSCLIM_Bits.INT */
#define IFX_SCU_DTSCLIM_INT_LEN (1u)

/** \brief Mask for Ifx_SCU_DTSCLIM_Bits.INT */
#define IFX_SCU_DTSCLIM_INT_MSK (0x1u)

/** \brief Offset for Ifx_SCU_DTSCLIM_Bits.INT */
#define IFX_SCU_DTSCLIM_INT_OFF (30u)

/** \brief Length for Ifx_SCU_DTSCLIM_Bits.UOF */
#define IFX_SCU_DTSCLIM_UOF_LEN (1u)

/** \brief Mask for Ifx_SCU_DTSCLIM_Bits.UOF */
#define IFX_SCU_DTSCLIM_UOF_MSK (0x1u)

/** \brief Offset for Ifx_SCU_DTSCLIM_Bits.UOF */
#define IFX_SCU_DTSCLIM_UOF_OFF (31u)

/** \brief Length for Ifx_SCU_TRAPDIS1_Bits.CPU4ESR0T */
#define IFX_SCU_TRAPDIS1_CPU4ESR0T_LEN (1u)

/** \brief Mask for Ifx_SCU_TRAPDIS1_Bits.CPU4ESR0T */
#define IFX_SCU_TRAPDIS1_CPU4ESR0T_MSK (0x1u)

/** \brief Offset for Ifx_SCU_TRAPDIS1_Bits.CPU4ESR0T */
#define IFX_SCU_TRAPDIS1_CPU4ESR0T_OFF (0u)

/** \brief Length for Ifx_SCU_TRAPDIS1_Bits.CPU4ESR1T */
#define IFX_SCU_TRAPDIS1_CPU4ESR1T_LEN (1u)

/** \brief Mask for Ifx_SCU_TRAPDIS1_Bits.CPU4ESR1T */
#define IFX_SCU_TRAPDIS1_CPU4ESR1T_MSK (0x1u)

/** \brief Offset for Ifx_SCU_TRAPDIS1_Bits.CPU4ESR1T */
#define IFX_SCU_TRAPDIS1_CPU4ESR1T_OFF (1u)

/** \brief Length for Ifx_SCU_TRAPDIS1_Bits.CPU4TRAP2T */
#define IFX_SCU_TRAPDIS1_CPU4TRAP2T_LEN (1u)

/** \brief Mask for Ifx_SCU_TRAPDIS1_Bits.CPU4TRAP2T */
#define IFX_SCU_TRAPDIS1_CPU4TRAP2T_MSK (0x1u)

/** \brief Offset for Ifx_SCU_TRAPDIS1_Bits.CPU4TRAP2T */
#define IFX_SCU_TRAPDIS1_CPU4TRAP2T_OFF (2u)

/** \brief Length for Ifx_SCU_TRAPDIS1_Bits.CPU4SMUT */
#define IFX_SCU_TRAPDIS1_CPU4SMUT_LEN (1u)

/** \brief Mask for Ifx_SCU_TRAPDIS1_Bits.CPU4SMUT */
#define IFX_SCU_TRAPDIS1_CPU4SMUT_MSK (0x1u)

/** \brief Offset for Ifx_SCU_TRAPDIS1_Bits.CPU4SMUT */
#define IFX_SCU_TRAPDIS1_CPU4SMUT_OFF (3u)

/** \brief Length for Ifx_SCU_TRAPDIS1_Bits.CPU5ESR0T */
#define IFX_SCU_TRAPDIS1_CPU5ESR0T_LEN (1u)

/** \brief Mask for Ifx_SCU_TRAPDIS1_Bits.CPU5ESR0T */
#define IFX_SCU_TRAPDIS1_CPU5ESR0T_MSK (0x1u)

/** \brief Offset for Ifx_SCU_TRAPDIS1_Bits.CPU5ESR0T */
#define IFX_SCU_TRAPDIS1_CPU5ESR0T_OFF (8u)

/** \brief Length for Ifx_SCU_TRAPDIS1_Bits.CPU5ESR1T */
#define IFX_SCU_TRAPDIS1_CPU5ESR1T_LEN (1u)

/** \brief Mask for Ifx_SCU_TRAPDIS1_Bits.CPU5ESR1T */
#define IFX_SCU_TRAPDIS1_CPU5ESR1T_MSK (0x1u)

/** \brief Offset for Ifx_SCU_TRAPDIS1_Bits.CPU5ESR1T */
#define IFX_SCU_TRAPDIS1_CPU5ESR1T_OFF (9u)

/** \brief Length for Ifx_SCU_TRAPDIS1_Bits.CPU5TRAP2T */
#define IFX_SCU_TRAPDIS1_CPU5TRAP2T_LEN (1u)

/** \brief Mask for Ifx_SCU_TRAPDIS1_Bits.CPU5TRAP2T */
#define IFX_SCU_TRAPDIS1_CPU5TRAP2T_MSK (0x1u)

/** \brief Offset for Ifx_SCU_TRAPDIS1_Bits.CPU5TRAP2T */
#define IFX_SCU_TRAPDIS1_CPU5TRAP2T_OFF (10u)

/** \brief Length for Ifx_SCU_TRAPDIS1_Bits.CPU5SMUT */
#define IFX_SCU_TRAPDIS1_CPU5SMUT_LEN (1u)

/** \brief Mask for Ifx_SCU_TRAPDIS1_Bits.CPU5SMUT */
#define IFX_SCU_TRAPDIS1_CPU5SMUT_MSK (0x1u)

/** \brief Offset for Ifx_SCU_TRAPDIS1_Bits.CPU5SMUT */
#define IFX_SCU_TRAPDIS1_CPU5SMUT_OFF (11u)

/** \brief Length for Ifx_SCU_TRAPSTAT_Bits.ESR0T */
#define IFX_SCU_TRAPSTAT_ESR0T_LEN (1u)

/** \brief Mask for Ifx_SCU_TRAPSTAT_Bits.ESR0T */
#define IFX_SCU_TRAPSTAT_ESR0T_MSK (0x1u)

/** \brief Offset for Ifx_SCU_TRAPSTAT_Bits.ESR0T */
#define IFX_SCU_TRAPSTAT_ESR0T_OFF (0u)

/** \brief Length for Ifx_SCU_TRAPSTAT_Bits.ESR1T */
#define IFX_SCU_TRAPSTAT_ESR1T_LEN (1u)

/** \brief Mask for Ifx_SCU_TRAPSTAT_Bits.ESR1T */
#define IFX_SCU_TRAPSTAT_ESR1T_MSK (0x1u)

/** \brief Offset for Ifx_SCU_TRAPSTAT_Bits.ESR1T */
#define IFX_SCU_TRAPSTAT_ESR1T_OFF (1u)

/** \brief Length for Ifx_SCU_TRAPSTAT_Bits.TRAP2 */
#define IFX_SCU_TRAPSTAT_TRAP2_LEN (1u)

/** \brief Mask for Ifx_SCU_TRAPSTAT_Bits.TRAP2 */
#define IFX_SCU_TRAPSTAT_TRAP2_MSK (0x1u)

/** \brief Offset for Ifx_SCU_TRAPSTAT_Bits.TRAP2 */
#define IFX_SCU_TRAPSTAT_TRAP2_OFF (2u)

/** \brief Length for Ifx_SCU_TRAPSTAT_Bits.SMUT */
#define IFX_SCU_TRAPSTAT_SMUT_LEN (1u)

/** \brief Mask for Ifx_SCU_TRAPSTAT_Bits.SMUT */
#define IFX_SCU_TRAPSTAT_SMUT_MSK (0x1u)

/** \brief Offset for Ifx_SCU_TRAPSTAT_Bits.SMUT */
#define IFX_SCU_TRAPSTAT_SMUT_OFF (3u)

/** \brief Length for Ifx_SCU_TRAPSET_Bits.ESR0T */
#define IFX_SCU_TRAPSET_ESR0T_LEN (1u)

/** \brief Mask for Ifx_SCU_TRAPSET_Bits.ESR0T */
#define IFX_SCU_TRAPSET_ESR0T_MSK (0x1u)

/** \brief Offset for Ifx_SCU_TRAPSET_Bits.ESR0T */
#define IFX_SCU_TRAPSET_ESR0T_OFF (0u)

/** \brief Length for Ifx_SCU_TRAPSET_Bits.ESR1T */
#define IFX_SCU_TRAPSET_ESR1T_LEN (1u)

/** \brief Mask for Ifx_SCU_TRAPSET_Bits.ESR1T */
#define IFX_SCU_TRAPSET_ESR1T_MSK (0x1u)

/** \brief Offset for Ifx_SCU_TRAPSET_Bits.ESR1T */
#define IFX_SCU_TRAPSET_ESR1T_OFF (1u)

/** \brief Length for Ifx_SCU_TRAPSET_Bits.TRAP2 */
#define IFX_SCU_TRAPSET_TRAP2_LEN (1u)

/** \brief Mask for Ifx_SCU_TRAPSET_Bits.TRAP2 */
#define IFX_SCU_TRAPSET_TRAP2_MSK (0x1u)

/** \brief Offset for Ifx_SCU_TRAPSET_Bits.TRAP2 */
#define IFX_SCU_TRAPSET_TRAP2_OFF (2u)

/** \brief Length for Ifx_SCU_TRAPSET_Bits.SMUT */
#define IFX_SCU_TRAPSET_SMUT_LEN (1u)

/** \brief Mask for Ifx_SCU_TRAPSET_Bits.SMUT */
#define IFX_SCU_TRAPSET_SMUT_MSK (0x1u)

/** \brief Offset for Ifx_SCU_TRAPSET_Bits.SMUT */
#define IFX_SCU_TRAPSET_SMUT_OFF (3u)

