zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxScu_bf.h
/** \brief Mask for Ifx_SCU_LCLCON0_Bits.LS2 */
#define IFX_SCU_LCLCON0_LS2_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LCLCON0_Bits.LS2 */
#define IFX_SCU_LCLCON0_LS2_OFF (0u)

/** \brief Length for Ifx_SCU_LCLCON0_Bits.LSEN2 */
#define IFX_SCU_LCLCON0_LSEN2_LEN (1u)

/** \brief Mask for Ifx_SCU_LCLCON0_Bits.LSEN2 */
#define IFX_SCU_LCLCON0_LSEN2_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LCLCON0_Bits.LSEN2 */
#define IFX_SCU_LCLCON0_LSEN2_OFF (15u)

/** \brief Length for Ifx_SCU_LCLCON0_Bits.LS0 */
#define IFX_SCU_LCLCON0_LS0_LEN (1u)

/** \brief Mask for Ifx_SCU_LCLCON0_Bits.LS0 */
#define IFX_SCU_LCLCON0_LS0_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LCLCON0_Bits.LS0 */
#define IFX_SCU_LCLCON0_LS0_OFF (16u)

/** \brief Length for Ifx_SCU_LCLCON0_Bits.LSEN0 */
#define IFX_SCU_LCLCON0_LSEN0_LEN (1u)

/** \brief Mask for Ifx_SCU_LCLCON0_Bits.LSEN0 */
#define IFX_SCU_LCLCON0_LSEN0_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LCLCON0_Bits.LSEN0 */
#define IFX_SCU_LCLCON0_LSEN0_OFF (31u)

/** \brief Length for Ifx_SCU_LCLCON1_Bits.LS3 */
#define IFX_SCU_LCLCON1_LS3_LEN (1u)

/** \brief Mask for Ifx_SCU_LCLCON1_Bits.LS3 */
#define IFX_SCU_LCLCON1_LS3_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LCLCON1_Bits.LS3 */
#define IFX_SCU_LCLCON1_LS3_OFF (0u)

/** \brief Length for Ifx_SCU_LCLCON1_Bits.LSEN3 */
#define IFX_SCU_LCLCON1_LSEN3_LEN (1u)

/** \brief Mask for Ifx_SCU_LCLCON1_Bits.LSEN3 */
#define IFX_SCU_LCLCON1_LSEN3_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LCLCON1_Bits.LSEN3 */
#define IFX_SCU_LCLCON1_LSEN3_OFF (15u)

/** \brief Length for Ifx_SCU_LCLCON1_Bits.LS1 */
#define IFX_SCU_LCLCON1_LS1_LEN (1u)

/** \brief Mask for Ifx_SCU_LCLCON1_Bits.LS1 */
#define IFX_SCU_LCLCON1_LS1_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LCLCON1_Bits.LS1 */
#define IFX_SCU_LCLCON1_LS1_OFF (16u)

/** \brief Length for Ifx_SCU_LCLCON1_Bits.LSEN1 */
#define IFX_SCU_LCLCON1_LSEN1_LEN (1u)

/** \brief Mask for Ifx_SCU_LCLCON1_Bits.LSEN1 */
#define IFX_SCU_LCLCON1_LSEN1_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LCLCON1_Bits.LSEN1 */
#define IFX_SCU_LCLCON1_LSEN1_OFF (31u)

/** \brief Length for Ifx_SCU_LCLTEST_Bits.LCLT0 */
#define IFX_SCU_LCLTEST_LCLT0_LEN (1u)

/** \brief Mask for Ifx_SCU_LCLTEST_Bits.LCLT0 */
#define IFX_SCU_LCLTEST_LCLT0_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LCLTEST_Bits.LCLT0 */
#define IFX_SCU_LCLTEST_LCLT0_OFF (0u)

/** \brief Length for Ifx_SCU_LCLTEST_Bits.LCLT1 */
#define IFX_SCU_LCLTEST_LCLT1_LEN (1u)

/** \brief Mask for Ifx_SCU_LCLTEST_Bits.LCLT1 */
#define IFX_SCU_LCLTEST_LCLT1_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LCLTEST_Bits.LCLT1 */
#define IFX_SCU_LCLTEST_LCLT1_OFF (1u)

/** \brief Length for Ifx_SCU_LCLTEST_Bits.LCLT2 */
#define IFX_SCU_LCLTEST_LCLT2_LEN (1u)

/** \brief Mask for Ifx_SCU_LCLTEST_Bits.LCLT2 */
#define IFX_SCU_LCLTEST_LCLT2_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LCLTEST_Bits.LCLT2 */
#define IFX_SCU_LCLTEST_LCLT2_OFF (2u)

/** \brief Length for Ifx_SCU_LCLTEST_Bits.LCLT3 */
#define IFX_SCU_LCLTEST_LCLT3_LEN (1u)

/** \brief Mask for Ifx_SCU_LCLTEST_Bits.LCLT3 */
#define IFX_SCU_LCLTEST_LCLT3_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LCLTEST_Bits.LCLT3 */
#define IFX_SCU_LCLTEST_LCLT3_OFF (3u)

/** \brief Length for Ifx_SCU_LCLTEST_Bits.LCLT4 */
#define IFX_SCU_LCLTEST_LCLT4_LEN (1u)

/** \brief Mask for Ifx_SCU_LCLTEST_Bits.LCLT4 */
#define IFX_SCU_LCLTEST_LCLT4_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LCLTEST_Bits.LCLT4 */
#define IFX_SCU_LCLTEST_LCLT4_OFF (4u)

/** \brief Length for Ifx_SCU_LCLTEST_Bits.LCLT5 */
#define IFX_SCU_LCLTEST_LCLT5_LEN (1u)

/** \brief Mask for Ifx_SCU_LCLTEST_Bits.LCLT5 */
#define IFX_SCU_LCLTEST_LCLT5_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LCLTEST_Bits.LCLT5 */
#define IFX_SCU_LCLTEST_LCLT5_OFF (5u)

/** \brief Length for Ifx_SCU_LCLTEST_Bits.PLCLT0 */
#define IFX_SCU_LCLTEST_PLCLT0_LEN (1u)

/** \brief Mask for Ifx_SCU_LCLTEST_Bits.PLCLT0 */
#define IFX_SCU_LCLTEST_PLCLT0_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LCLTEST_Bits.PLCLT0 */
#define IFX_SCU_LCLTEST_PLCLT0_OFF (16u)

/** \brief Length for Ifx_SCU_LCLTEST_Bits.PLCLT1 */
#define IFX_SCU_LCLTEST_PLCLT1_LEN (1u)

/** \brief Mask for Ifx_SCU_LCLTEST_Bits.PLCLT1 */
#define IFX_SCU_LCLTEST_PLCLT1_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LCLTEST_Bits.PLCLT1 */
#define IFX_SCU_LCLTEST_PLCLT1_OFF (17u)

/** \brief Length for Ifx_SCU_LCLTEST_Bits.PLCLT2 */
#define IFX_SCU_LCLTEST_PLCLT2_LEN (1u)

/** \brief Mask for Ifx_SCU_LCLTEST_Bits.PLCLT2 */
#define IFX_SCU_LCLTEST_PLCLT2_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LCLTEST_Bits.PLCLT2 */
#define IFX_SCU_LCLTEST_PLCLT2_OFF (18u)

/** \brief Length for Ifx_SCU_LCLTEST_Bits.PLCLT3 */
#define IFX_SCU_LCLTEST_PLCLT3_LEN (1u)

/** \brief Mask for Ifx_SCU_LCLTEST_Bits.PLCLT3 */
#define IFX_SCU_LCLTEST_PLCLT3_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LCLTEST_Bits.PLCLT3 */
#define IFX_SCU_LCLTEST_PLCLT3_OFF (19u)

/** \brief Length for Ifx_SCU_LCLTEST_Bits.PLCLT4 */
#define IFX_SCU_LCLTEST_PLCLT4_LEN (1u)

/** \brief Mask for Ifx_SCU_LCLTEST_Bits.PLCLT4 */
#define IFX_SCU_LCLTEST_PLCLT4_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LCLTEST_Bits.PLCLT4 */
#define IFX_SCU_LCLTEST_PLCLT4_OFF (20u)

/** \brief Length for Ifx_SCU_LCLTEST_Bits.PLCLT5 */
#define IFX_SCU_LCLTEST_PLCLT5_LEN (1u)

/** \brief Mask for Ifx_SCU_LCLTEST_Bits.PLCLT5 */
#define IFX_SCU_LCLTEST_PLCLT5_MSK (0x1u)

/** \brief Offset for Ifx_SCU_LCLTEST_Bits.PLCLT5 */
#define IFX_SCU_LCLTEST_PLCLT5_OFF (21u)

/** \brief Length for Ifx_SCU_CHIPID_Bits.CHREV */
#define IFX_SCU_CHIPID_CHREV_LEN (6u)

/** \brief Mask for Ifx_SCU_CHIPID_Bits.CHREV */
#define IFX_SCU_CHIPID_CHREV_MSK (0x3fu)

/** \brief Offset for Ifx_SCU_CHIPID_Bits.CHREV */
#define IFX_SCU_CHIPID_CHREV_OFF (0u)

/** \brief Length for Ifx_SCU_CHIPID_Bits.CHTEC */
#define IFX_SCU_CHIPID_CHTEC_LEN (2u)

/** \brief Mask for Ifx_SCU_CHIPID_Bits.CHTEC */
#define IFX_SCU_CHIPID_CHTEC_MSK (0x3u)

/** \brief Offset for Ifx_SCU_CHIPID_Bits.CHTEC */
#define IFX_SCU_CHIPID_CHTEC_OFF (6u)

/** \brief Length for Ifx_SCU_CHIPID_Bits.CHPK */
#define IFX_SCU_CHIPID_CHPK_LEN (4u)

